#include <iostream>
#include <Windows.h>

// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!
// Привет юный друг, начнем с того что если ты открыл этот проект то можешь его закрыть. он тебе не пренадлежит!!


	int main() {

		SetConsoleCP(CP_UTF8);
		SetConsoleOutputCP(CP_UTF8);


		int yablochniy = 150;
		int apelsinoviy = 200;
		int abrikosoviy = 150;
		int grishoviy = 200;
		int tomat = 75;
		int lukoviy = 67;
		int ogyrec = 50;
		int chesnochniy = 70;
		int petrysheviy = 80;

		double yablochniy1 = 0;
		double apelsinoviy1 = 0;
		double abrikosoviy1 = 0;
		double grishoviy1 = 0;
		double tomat1 = 0;
		double lukoviy1 = 0;
		double ogyrec1 = 0;
		double chesnochniy1 = 0;
		double petrysheviy1 = 0;
		double cena = 0;
		double cena1 = 0;
		double free = 0;
		int fixcena = 10000;

		while (true) {
		

			int vibor = 0;
			int kolvo = 0;

			system("cls");
			std::cout << "\n\n\t\t\t==========-- Соки Александра :D --==========\n\n\n\n";
			std::cout << "Выберите категорию которая вас интересует:\n";
			std::cout << "1)Фруктовые соки\n2)Овощьные соки\n3)Чаи\n4)Акции сегодня\n5)К оплате\n0)Выход\nОтвет:";
			std::cin >> vibor;

			if (vibor == 1) {
				while (true) {
					system("cls");
					std::cout << "\t\t\t\tФруктовые соки: \n1)Яблочный - 150 рублей \n2)Апельсновый - 200 рублей \n3)Абрикосовый - 150 рублей \n4)Грушевый - 200 рублей\n0)Выход\nОтвет:";
					std::cin >> vibor;
					if (vibor == 1) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						yablochniy1 = kolvo * yablochniy;
						break;
					}
					else if(vibor == 2) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						apelsinoviy1 = kolvo * apelsinoviy;
						break;
					}
					else if(vibor == 3) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						abrikosoviy1 = kolvo * abrikosoviy;
						break;
					}
					else if(vibor == 4) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						grishoviy1 = kolvo * grishoviy;
						break;
					}
					else if (vibor == 0) {
						break;
					}
					else {
						std::cout << "Неккоректный ввод. попробуйте еще раз.";
						Sleep(1500);
					}
				}
			}
			else if (vibor == 2) {
				while (true) {
					system("cls");
					std::cout << "\t\t\t\tОвощные соки: \n\n1)Томатный\n2)Луковый\n3)Огуречный\n0)Выход\nОтвет:";
					std::cin >> vibor;
					if (vibor == 1) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						tomat1 = kolvo * tomat;
						break;
					}
					else if (vibor == 2) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						if (kolvo >= 4) {
							free = kolvo / 4;
							lukoviy1 = lukoviy - free;
							break;
						}
						else if (kolvo < 4) {
							lukoviy1 = kolvo * lukoviy;
						}
						else {
							std::cout << "Неккоректный ввод. попробуйте еще раз.";
							Sleep(1500);
						}
						
						break;
					}
					else if (vibor == 3) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						ogyrec1 = kolvo * ogyrec;
						break;
					}
					else if (vibor == 0) {
						break;
					}
					else {
						std::cout << "Неккоректный ввод. попробуйте еще раз.";
						Sleep(1500);
					}
				}
			}
			else if (vibor == 3) {
				while (true) {
				system("cls");
				std::cout << "\t\t\t\tЧаи: \n\n1)Петрушевый\n2)Чесночный\n0)Выход\nОтвет:";
				std::cin >> vibor;
					if (vibor == 1) {
					std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
					std::cin >> kolvo;
					if (kolvo >= 3) {
						petrysheviy1 = (kolvo * petrysheviy) - 0.05;
						break;
					}
					else if(kolvo < 3) {
						petrysheviy1 = kolvo * petrysheviy;
						break;
					}


					}
					else if (vibor == 2) {
						std::cout << "Кол-во литров которое вы хотите добавить в корзину?\nОтвет:";
						std::cin >> kolvo;
						chesnochniy1 = kolvo * chesnochniy;
						break;
					}
					else if (vibor == 0) {
						break;
					}
					else {
						std::cout << "Неккоректный ввод. попробуйте еще раз.";
						Sleep(1500);
					}
				}
			
			}
			else if (vibor == 0) {
				std::cout << "Досвидания!";
				Sleep(1500);
				system("cls");
				return 0;
			}
			else if (vibor == 4) {
				system("cls");
				std::cout << "\t\t\tАкции сегодня:\n\n";
					std::cout << "При покупе 3л петрушевого чая, скидка на него 5%.\n";
					std::cout << "Если сумма в чеке более 10.000 рублей то скидка 13% на весь чек.\n";
					std::cout << "Каждый 4 литр лукового сока будет в подарок.\n";
					system("pause");
			}
			else if (vibor == 5) {
				system("cls");
				cena =  yablochniy1 + apelsinoviy1  + abrikosoviy1  + grishoviy1  + tomat1  + lukoviy1 + ogyrec1 + chesnochniy1 + petrysheviy1 ;

				if (cena >= fixcena) {
					cena1 = cena - (cena * 0.13);
					std::cout << "Ваша сумма в чеке больше 10.000 рублей,применяется скидка 13%\nВаша сумма чека:" << cena1 << "\n";
					system("pause");
				}
				else {
					std::cout << "Ваша сумма в чеке:" << cena << "\n";
					system("pause");
				}
				

			}
			else{
				std::cout << "Неккоректный ввод. попробуйте еще раз.";
				Sleep(1500);
			}
			

















		}










		return 0;
	}
 /*
SetConsoleCP(CP_UTF8);
SetConsoleOutputCP(CP_UTF8); // Это чтобы сделать русский язык

std::cout << "\n\t\tHello world " << 10 << "Sub to loxxik \n"
	<< "information:" << std::endl;
std::cout << "text:\n\n"; // Это база которую проходили на 1 и 2 паре.


std::cout << "Александр\n";
std::cout << "\tВосполнять голод\n";
std::cout << "\t\tХз,пускай будет он угарный\n";
std::cout << "\t" << 10 << "\n";
std::cout << "Что - предлог в Русском языке.\n"; 
//это практика /t /n и цифр на 2 паре.

	





	Типы данных:

	bool					true/false			0 - false. все другое - true
	char					'+'					43
	unsigned char			'+'					43		0 - 255

	short					123					-32768	--	32767

	int						123456789			-214783648 -- 2147483647
	unsigned int			123456789			0 - 4294967295
	long long int

	float					123456.987654
	double					987646523149.156546

	Операторы:
	Математические: + - * / = % ++ -- += -= *= /= ()
	Сравнительные: < > <= >= ++ != <=>
	Логические: && (и)			|| (или)	!	(не)

	ТАБУ: goto		and or not		int имяПеременной




	double a = 0;
	double b = 0;

	if (b == 0)
	{
	std::cout << 1;
	}
	else if (b > 0)
	{
		std::cout << 2;
	}
	else
	{
		std::cout << 3;
	}

	std::cin >> a;
	std::cin >> b;
	std::cout << a << "\n" << b << "\n";

	=========================================================================

	double a = 0;
	double valuta = 0;
	int pokypka = 0;
	int karta = 0;

	std::cout << "Приветствую! Выберите валюту:\n";
	std::cout << "1)Доллар  \n2)Евро \n3)Фарит \n4)Юань\n";
	std::cout << "Валюта номер: ";
	std::cin >> valuta;
	if (valuta < 1 || valuta > 4) {
		std::cout << "Неверная валюта! Укажите верную валюту (1-4).\n";
		return 0;
	}
	std::cout << "\nСколько у вас Рублей?: ";
	std::cin >> a;

	a = a / 0.95;

	if (valuta == 1)
	{
		std::cout << a / 86.47 << " Долларов вы можете купить.";
		std::cout << "Вы хотите совершить покупку?(1-2) \n1)Да,Совершить покупку. \n2)Нет.\nОтвет:";
		std::cin >> pokypka;
		if (pokypka == 1) {
			std::cout << "Покупка совершенна успешно.";
		}
		else if (pokypka == 2) {
			std::cout << "Покупка отменена.";
		}
		else if (pokypka > 2) {
			std::cout << "Это не верное число!";

		}
		else if (valuta == 2)
		{
			std::cout << a / 100.5 << " Евро вы можете купить.";
			std::cout << "Вы хотите совершить покупку?(1-2) \n1)Да,Совершить покупку. \n2)Нет.\nОтвет:";
			std::cin >> pokypka;
			if (pokypka == 1) {
				std::cout << "Покупка совершенна успешно.";
			}
			else if (pokypka == 2) {
				std::cout << "Покупка отменена.";
			}
			else if (pokypka > 2) {
				std::cout << "Это не верное число!";

			}
			else if (valuta == 3)
			{
				std::cout << "Фарита нельзя купить. ";
			}
			else if (valuta == 4)
			{
				std::cout << a / 12.88 << " Юаней вы можете купить.\n";
				std::cout << "Вы хотите совершить покупку?(1-2) \n1)Да,Совершить покупку. \n2)Нет.\nОтвет:";
				std::cin >> pokypka;
				if (pokypka == 1) {
					std::cout << "Покупка совершенна успешно.";
				}
				else if (pokypka == 2) {
					std::cout << "Покупка отменена.";
				}
				else if (pokypka > 2) {
					std::cout << "Это не верное число!";

			}
		}
	}
	}                     // Конвертер валют
	=========================================================================


	double a = 0, b = 0, c = 0, d = 0, x1 = 0, x2 = 0;


	std::cout << "Решение полного квадратного уравнения \n\n";
	std::cout << "ax^2 + bx + c = 0\n\n";
	std::cout << "Введите А:";
	std::cin >> a;
	std::cout << "Введите Б:";
	std::cin >> b;
	std::cout << "Введите С:";
	std::cin >> c;

	std::cout << a << "x^2 + " << b << "x + " << c << " = 0\n\n";

	d = std::pow(b, 2) - 4 * a * c; // это возводит в степень.
	std::cout << "Дискриминант: " << d << "\n\n";

	if (d < 0)
	{
		std::cout << "Корней нет! \n";
	}
	else if (d == 0)
	{
		x1 = -b / (2 * a);
		std::cout << "Один корень: " << x1 << "\n";
	}
	else
	{
		x1 = (-b + std::sqrt(d)) / (2 * a); //освобождает данные стеков. (чет такое)
			x2 = (-b - std::sqrt(d)) / (2 * a);
			std::cout << "Первый корень: " << x1 << "\n";
			std::cout << "Второй корень: " << x2 << "\n";
	}


	=========================================================================



		SetConsoleCP(CP_UTF8);
	SetConsoleOutputCP(CP_UTF8); // Это чтобы сделать русский язык
	srand(time(NULL)); // нужно для рандомайзера

	int chislo = 0;
	int hp = 0;
	int random = 0;
	int pc = 0;
	int maxhp = 25;
	int maxhphard = 25;
	int chance = 25;

	while (true)
	{
		system("cls"); // Это автоматом чистит консоль
		std::cout << "\n\n\n\t\tИгра \"Угадай число\"\n\n\n";
		std::cout << "1) Играть\n";
		std::cout << "2) Настройки\n";
		std::cout << "0) Выход\n";
		std::cout << "Ответ:";
		std::cin >> chislo;

		if (chislo == 1)
		{
			while (true)
			{
				system("cls");
				std::cout << "\n\n\n\t\tИгра \"Угадай число\"\n\n\n";
				std::cout << "Выбери режим игры:\n";
				std::cout << "1) Легкий режим (1-250)\n";
				std::cout << "2) Сложный (1-5000)\n";
				std::cout << "0) Выход в меню\n";
				std::cout << "Ответ:";
				std::cin >> chislo;

				if (chislo == 1)
				{
					pc = rand() % 250 + 1;
					hp = maxhp;
					while (true)
					{
						system("cls");


						std::cout << "Игра началась!\nвведите число от 1 до 250. Ваши хп = " << hp << "\nОтвет:";

						std::cin >> random;

						if (random == pc)
						{
							std::cout << "Вы выйграли! вы угадали число которое загадал компьютер.\n";
							std::cout << "Ваших хп осталось = " << hp << "\n";
							system("pause");
							break;
						}
						else if (random < 1 || random > 250)
						{
							std::cout << "Вы вышли за лимиты.";
							Sleep(1200);
						}
						else
						{
							hp--;
							if (hp <= 0)
							{
								std::cout << "Вы проиграли!\n";
								std::cout << "Число компьютера было : " << pc << "\n";
								system("pause");
								break;



							}
							std::cout << "Неверно\n";

							std::cout << "Кол - во жизней :" << hp << "\n";
							std::cout << "Взять подсказку за 1 жизнь?\n";
							std::cout << "1)Да\n2)Нет\nОтвет: ";
							std::cin >> chislo;

							if (chislo == 1)
							{
								hp--;
								if (hp <= 0)
								{
									std::cout << "Вы проиграли!\n";
									std::cout << "Число компьютера было : " << pc << "\n";
									system("pause");
									break;
								}
								if (random < pc)
								{
									std::cout << "Ваше число МЕНЬШЕ числа компьютера.";
								}
								else
								{
									std::cout << "Ваше число БОЛЬШЕ числа компьютера.";
								}
								Sleep(2000);
							}
							else
							{
								std::cout << "Отказ от подсказки\n";
								Sleep(500);
							}

						}







					}
				}
				else if (chislo == 2)
				{
					pc = rand() % 5000 + 1; //райндомайзер
					hp = maxhphard;
					while (true)
					{
						system("cls");


						std::cout << "Игра началась!\nвведите число от 1 до 5000. Ваши хп = " << hp << "\nОтвет:";

						std::cin >> random;

						if (random == pc)
						{
							std::cout << "Вы выйграли! вы угадали число которое загадал компьютер.\n";
							std::cout << "Ваших хп осталось = " << hp << "\n";
							system("pause");
							break;
						}
						else if (random < 1 || random > 5000)
						{
							std::cout << "Вы вышли за лимиты.";
							Sleep(1200);
						}
						else
						{
							hp--;
							if (hp <= 0)
							{
								std::cout << "Вы проиграли!\n";
								std::cout << "Число компьютера было : " << pc << "\n";
								system("pause");
								break;



							}
							std::cout << "Неверно\n";

							std::cout << "Кол - во жизней :" << hp << "\n";
							std::cout << "Взять подсказку за 1 жизнь?\n";
							std::cout << "1)Да\n2)Нет\nОтвет: ";
							std::cin >> chislo;

							if (chislo == 1)
							{
								if (rand() % 101 <= chance)
								{
									std::cout << "Бесплатная подсказка\n";
									Sleep(1000);

								}
								else
								{

								hp--;
								if (hp <= 0)
									{
									std::cout << "Вы проиграли!\n";
									std::cout << "Число компьютера было : " << pc << "\n";
									system("pause");
									break;
									}
								}
								if (random < pc)
								{
									std::cout << "Ваше число МЕНЬШЕ числа компьютера.";
								}
								else
								{
									std::cout << "Ваше число БОЛЬШЕ числа компьютера.";
								}
								Sleep(2000);
							}
							else
							{
								std::cout << "Отказ от подсказки\n";
								Sleep(500);
							}
						}
					}
				}
				else if (chislo == 0)
				{
					break;
				}
				else
				{
					std::cout << "Неверный ввод,попробуй еще раз.\n\n";
					Sleep(1500);
				}





			}
		}
		else if (chislo == 2)
		{
			while (true)
			{
				system("cls");
				std::cout << "\n\n\n\t\tНастройки игры\n\n\n";
				std::cout << "1) Изменить кол-во жизней для легкой игры\n";
				std::cout << "2) Изменить кол-во жизней для сложной игры\n";
				std::cout << "3) Изменить шанс бесплатной подсказки для сложной игры\n";
				std::cout << "0) Выход в меню\n";
				std::cout << "Ответ:";
				std::cin >> chislo;
				if (chislo == 1)
				{
					while (true)
					{
						system("cls");
						std::cout << "Введите кол-во жизней для лёгкой игры: ";
						std::cin >> chislo;
						if (chislo < 1 || chislo > 100)
						{
							std::cout << "Допустимый лимит от 1 до 100\n";
							Sleep(1500);
						}
						else
						{
							std::cout << "Успешно\n";
							maxhp = chislo;
							Sleep(1000);
							break;
						}
					}
				}
				else if (chislo == 2)
				{
					while (true)
					{
						system("cls");
						std::cout << "Введите кол-во жизней для сложной игры: ";
						std::cin >> chislo;
						if (chislo < 1 || chislo > 100)
						{
							std::cout << "Допустимый лимит от 1 до 100\n";
							Sleep(1500);
						}
						else
						{
							std::cout << "Успешно\n";
							maxhphard = chislo;
							Sleep(1000);
							break;
						}
					}
				}
				else if (chislo == 3)
				{
					system("cls");
					std::cout << "Введите шанс бесплатной подсказки для сложной игры: ";
					std::cin >> chislo;
					if (chislo < 0 || chislo > 100)
					{
						std::cout << "Допустимый лимит от 0 до 100\n";
						Sleep(1500);
					}
					else
					{
						std::cout << "Успешно\n";
						chance = chislo;
						Sleep(1000);
						break;
					}
				}
				else if (chislo == 0)
				{
					break;
				}
				else
				{
					std::cout << "неверный ввод.";
					Sleep(1500);
				}

			}
		}
		else if (chislo == 0)
		{
			system("cls");
			std::cout << "Выход из программы.\n";
			Sleep(750);
			std::cout << "Выход из программы..\n";
			Sleep(750);
			std::cout << "Выход из программы...\n";
			Sleep(750);
			break;
		}
		else
		{
			std::cout << "Неверный ввод,попробуй еще раз.\n\n";
			Sleep(1500);

		}
		// игра очень крутая

		========================================================================

		template<typename T1>
T1 Substruct(T1 one, T1 two)
{
	return one - two;
}

void Test()
{
	Substruct(10.5, 8);





}







	}














*/










